luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDma_regdef.h
/** \brief  DMA Clear Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_CLRE_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_BLK_CLRE;

/** \brief  DMA Enable Error Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_EER_Bits B;                 /**< \brief Bitfield access */
} Ifx_DMA_BLK_EER;

/** \brief  DMA Error Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ERRSR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ERRSR;

/** \brief  DMA Move Engine Channel Address and Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_ADICR_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_ADICR;

/** \brief  DMA Move Engine Channel Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_CHCR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_CHCR;

/** \brief  DMA Move Engine Channel Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_CHSR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_CHSR;

/** \brief  DMA Move Engine Channel Destination Address Register x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_DADR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_DADR;

/** \brief  DMA Move Engine Read Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R0_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R0;

/** \brief  DMA Move Engine Read Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R1_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R1;

/** \brief  DMA Move Engine Read Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R2_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R2;

/** \brief  DMA Move Engine Read Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R3_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R3;

/** \brief  DMA Move Engine Read Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R4_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R4;

/** \brief  DMA Move Engine Read Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R5_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R5;

/** \brief  DMA Move Engine Read Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R6_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R6;

/** \brief  DMA Move Engine Read Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_R7_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_R7;

/** \brief  DMA Move Engine Channel Read Data CRC Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_RDCRC_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_RDCRC;

/** \brief  DMA Move Engine Channel Source Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SADR_Bits B;             /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SADR;

/** \brief  DMA Move Engine Channel Source and Destination Address CRC Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SDCRC_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SDCRC;

/** \brief  DMA Move Engine Channel Shadow Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SHADR_Bits B;            /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SHADR;

/** \brief  DMA Move Engine Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_BLK_ME_SR_Bits B;               /**< \brief Bitfield access */
} Ifx_DMA_BLK_ME_SR;

/** \brief  DMA Channel Address and Interrupt Control Register x */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_DMA_CH_ADICR_Bits B;                /**< \brief Bitfield access */
} Ifx_DMA_CH_ADICR;

